## 1. Pandas(판다스 기초 개념)

### 데이터 구조 
1. 비정형 데이터: 형태가 정의되지 않았다는 것을 의미함. 정형데이터로 만들어야 모델 생성할 때 사요할 수 있음
2. 정형 데이터
ex)  학교 에있는 학생 데이터를 사용하려고 할 때, 학번, 이름, 학부, 학년, 전화번호, 주소 등의 데이터가 있을 수 있음.  ⇒ 정해진 데이터가 존재함

### Numpy(넘파이)
- 수학 및 과학 연산을 위한 파이썬 패키지

In [13]:
import numpy as np

### Pandas(판다스)
- 파이썬 데이터 처리를 위한 데이터 분석 라이브러리

In [5]:
import pandas as pd #판다스 모듈을 불러오는 수식 pandas 를 pd라고 부르겠다

### Series(시리즈)
- single row 또는 single column을 의미함 
- 1차원 배열의 자료구조

#### [Series 만드는 방법]

#### 1) 파이썬 list를 series로 변환

In [8]:
customer = ['홍길동', '김수진', '김철수']
pd.Series(customer)

0    홍길동
1    김수진
2    김철수
dtype: object

In [9]:
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

##### 2) 파이썬 딕셔너리 타입을 series로 변환

In [10]:
customer_no_name = {'10001':'홍인표', '10002':'김학동', '10003':'안은영', '10004':'고길동'}
cust_info = pd.Series(customer_no_name)
cust_info

10001    홍인표
10002    김학동
10003    안은영
10004    고길동
dtype: object

In [11]:
cust_info.index #.index는 해당 series의 index 확인할 수 있음

Index(['10001', '10002', '10003', '10004'], dtype='object')

#### 3) 직접 series와 index 하나하나 쓰기

In [6]:
customer = pd.Series(['홍길동', '김수진', '김철수'], index=['10001', '10002', '10003'])
customer

10001    홍길동
10002    김수진
10003    김철수
dtype: object

### DataFrame(데이터 프레임)
- 데이터를 표의 형태로 처리할 수 있는 자료구조

#### 1) 파이썬 list 이용하여 DataFrame만들기

In [19]:
customer_1 = pd.Series({'Name':'홍길동', 'phone_no':'01011112222', '1Q_point':'90'}) #시리즈
customer_2 = pd.Series({'Name':'김수진', 'phone_no':'01012341234', '1Q_point':'70'}) #시리즈
customer_3 = pd.Series({'Name':'홍길동', 'phone_no':'01099998888', '1Q_point':'22.5'}) #시리즈
df = pd.DataFrame([customer_1, customer_2, customer_3]) #시리즈 3개를 df라는 이름의 데이터 프레임으로 바꾸기

In [20]:
df #데이터 프레임 확인하기

  Name     phone_no 1Q_point
0  홍길동  01011112222       90
1  김수진  01012341234       70
2  홍길동  01099998888     22.5

In [21]:
df.index #index값 주지 않았으므로 0부터 3그리고 1씩 증가

RangeIndex(start=0, stop=3, step=1)

#### df에 새로운 index 붙여주기

In [45]:
df = pd.DataFrame([customer_1, customer_2, customer_3], index=['10001', '10002','10003'])
df

      Name     phone_no 1Q_point
10001  홍길동  01011112222       90
10002  김수진  01012341234       70
10003  홍길동  01099998888     22.5

#### Row(행), Column(열)
- Column(열): 데이터의 성격, 데이터의 속성 
- row(행): 데이터

In [46]:
df

      Name     phone_no 1Q_point
10001  홍길동  01011112222       90
10002  김수진  01012341234       70
10003  홍길동  01099998888     22.5

- Name, phone_no, 1Q_point와 같이 데이터 속성을 나타내는 가로 값을 열이라고 함 
- 홍길동, 김수진, 90, 70 등과 같이 데이터 자체의 세로 값을 행이라고 함

### df 다루기/ 다양한 내재 함수 배우기

In [47]:
df

      Name     phone_no 1Q_point
10001  홍길동  01011112222       90
10002  김수진  01012341234       70
10003  홍길동  01099998888     22.5

#### 1) iloc : 행이나 칼럼의 순서를 나타내는 정수로 특정 값을 추출

- df.iloc[행 인덱스, 열 인덱스]

In [48]:
df.iloc[0] #0번째 행 추출

Name                홍길동
phone_no    01011112222
1Q_point             90
Name: 10001, dtype: object

In [49]:
df.iloc[0,1] #0번째 행, 1번째 열만 추출

'01011112222'

In [50]:
df.iloc[:2,:2] #2번행까지, 2번 열까지만 추출

      Name     phone_no
10001  홍길동  01011112222
10002  김수진  01012341234

#### 2) loc: 사람이 읽을 수 있는 라벨 값으로 특정 값을 추출

- df.loc[행 인덱싱 값, 열 인덱싱 값]
- loc[]에 하나의 값만 입력하면 그에 해당되는 하나의 행만 뽑아 온다

In [55]:
df.loc['10001'] #10001번 인덱스 행

Name                홍길동
phone_no    01011112222
1Q_point             90
Name: 10001, dtype: object

In [54]:
df.loc['10001','Name'] #100001 번 행 값 중 'Name'이라는 열의 값만 추출

'홍길동'

In [35]:
df['Name'] #loc을 사용하지 않아도 해당 데이터 프레임['열 이름']치면 값을 추출할 수 있다

0    홍길동
1    김수진
2    홍길동
Name: Name, dtype: object

In [36]:
df[['Name']] #데이터프레임으로

  Name
0  홍길동
1  김수진
2  홍길동

In [37]:
df['Name']=='홍길동' #data가 나오는게 아니라 T/F 값으로 나옴

0     True
1    False
2     True
Name: Name, dtype: bool

In [38]:
df[df['Name']=='홍길동'] #df안에 condion을 넣어야함

  Name     phone_no 1Q_point
0  홍길동  01011112222       90
2  홍길동  01099998888     22.5

In [39]:
df['1Q_point']> '50'

0     True
1     True
2    False
Name: 1Q_point, dtype: bool

In [40]:
df[df['1Q_point'] > '50']

  Name     phone_no 1Q_point
0  홍길동  01011112222       90
1  김수진  01012341234       70

In [41]:
df[(df['Name']=='홍길동')| (df['1Q_point']>  '50')] # |는 or 의미

  Name     phone_no 1Q_point
0  홍길동  01011112222       90
1  김수진  01012341234       70
2  홍길동  01099998888     22.5

In [42]:
df[(df['Name']=='홍길동')& (df['1Q_point']< '50')] # &는 and 의미

  Name     phone_no 1Q_point
2  홍길동  01099998888     22.5

### .drop()
- 해당 열, 행 삭제

In [56]:
df.drop('10001')

      Name     phone_no 1Q_point
10002  김수진  01012341234       70
10003  홍길동  01099998888     22.5

In [57]:
df.drop(['10001', '10002']) #행 drop

      Name     phone_no 1Q_point
10003  홍길동  01099998888     22.5

In [58]:
df.drop(columns=['phone_no','1Q_point']) #열  drop

      Name
10001  홍길동
10002  김수진
10003  홍길동

#### 데이터 프레임 복사/셍성

In [59]:
df_copy = df.drop('10001') #10001번이 drop된 df를 복제헤서 df_copy라는 이름으로 저장
df_copy

      Name     phone_no 1Q_point
10002  김수진  01012341234       70
10003  홍길동  01099998888     22.5

#### 데이터 프레임 칼럼 이름 바꾸기

In [60]:
df_1Q = df
df_1Q
df_1Q.rename(columns={'1Q_point':'Total_point'}) #column 이름 다시 바꾸기

      Name     phone_no Total_point
10001  홍길동  01011112222          90
10002  김수진  01012341234          70
10003  홍길동  01099998888        22.5

In [62]:
df_1Q.rename(columns={'1Q_point':'Total_point'}, inplace =True) #inplace = True 해야 변경된 값이 저장됨 
df_1Q

      Name     phone_no Total_point
10001  홍길동  01011112222          90
10002  김수진  01012341234          70
10003  홍길동  01099998888        22.5

#### 새로운 칼럼과 row 추가하기

In [63]:
df_point = df
df_point['2Q_point'] = [80, 40, 100]
df_point

      Name     phone_no Total_point  2Q_point
10001  홍길동  01011112222          90        80
10002  김수진  01012341234          70        40
10003  홍길동  01099998888        22.5       100

## 2. 올림픽 데이터 사용하면서 pandas 개념 익히기

In [69]:
df_olympics = pd.read_excel('C:/Users/82104/Desktop/CAU/2-1/Data/olympics_organized-1.xlsx')
df_olympics

,Country,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
141,Yugoslavia,16,26,29,28,83,14,0,3,1,4,30,26,32,29,87
142,Independent Olympic Participants,1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
143,Zambia,12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
144,Zimbabwe,12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
145,Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17

- 엑셀파일 불러울 때, pd.read_excel 사용 
- csv 파일 불러올 때, pd.read_csv 사용

- 괄호 안에 해당 파일 경로 넣어줘야함 
- 경로 확인 방법: 해당 파일 우클릭 -> 속성 -> 위치 복사 붙여넣기 -> 뒤에 해당 파일 이름 + 확장자명 넣기    
ex) C:/Users/82104/Desktop/CAU/olympics.csv

### .head()/tail()
- 데이터 프레임 상위 5개, 하위 5개 행 출력

In [71]:
df_olympics.head()

,Country,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [72]:
df_olympics.tail()

,Country,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
141,Yugoslavia,16,26,29,28,83,14,0,3,1,4,30,26,32,29,87
142,Independent Olympic Participants,1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
143,Zambia,12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
144,Zimbabwe,12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
145,Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17

### .shape
- 행, 열 개수 확인

In [79]:
df_olympics.shape # 146개의 행 16개의 열

(146, 16)

### isnull.sum()
- 결측치 개수 파악

In [83]:
df_olympics.isnull() #결측치 여부 t/f로 나옴

,Country,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
141,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
142,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
143,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
144,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
145,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [85]:
df_olympics.isnull().sum() #true값 합산하는 것

Country           0
# Summer          0
Gold              0
Silver            0
Bronze            0
Total             0
# Winter          0
Gold.1            0
Silver.1          0
Bronze.1          0
Total.1           0
# Games           0
Gold.2            0
Silver.2          0
Bronze.2          0
Combined total    0
dtype: int64

### info(): 컬럼별 데이터 수 & 데이터 타입 한번에 확인

In [86]:
df_olympics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country         146 non-null    object
 1   # Summer        146 non-null    int64
 2   Gold            146 non-null    int64
 3   Silver          146 non-null    int64
 4   Bronze          146 non-null    int64
 5   Total           146 non-null    int64
 6   # Winter        146 non-null    int64
 7   Gold.1          146 non-null    int64
 8   Silver.1        146 non-null    int64
 9   Bronze.1        146 non-null    int64
 10  Total.1         146 non-null    int64
 11  # Games         146 non-null    int64
 12  Gold.2          146 non-null    int64
 13  Silver.2        146 non-null    int64
 14  Bronze.2        146 non-null    int64
 15  Combined total  146 non-null    int64
dtypes: int64(15), object(1)
memory usage: 18.4+ KB

### describe(): 수치형 변수 확인

In [87]:
df_olympics.describe()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
count,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000,146.000000
mean,13.383562,32.938356,32.705479,35.136986,100.780822,6.595890,6.568493,6.561644,6.493151,19.623288,19.979452,39.506849,39.267123,41.630137,120.404110
std,7.006657,96.745184,80.648421,77.118416,252.700436,7.349012,18.975086,18.606996,17.499654,54.640914,13.084062,109.932471,93.984393,89.826117,291.988913
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,8.000000,0.000000,1.000000,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,11.000000,0.000000,1.000000,1.000000,2.250000
50%,13.000000,3.000000,4.000000,6.000000,12.000000,5.000000,0.000000,0.000000,0.000000,0.000000,15.000000,3.000000,4.000000,6.500000,12.000000
75%,18.000000,23.000000,26.750000,28.750000,85.250000,10.000000,0.750000,1.750000,1.000000,4.750000,26.000000,24.500000,28.000000,29.000000,87.750000
max,27.000000,976.000000,757.000000,666.000000,2399.000000,22.000000,118.000000,111.000000,100.000000,329.000000,49.000000,1072.000000,859.000000,750.000000,2681.000000

### unique(): 특정 칼럼의 듀일한 값 확인

In [92]:
df_olympics['Gold'].unique()

array([  0,   5,  18,   1,   3, 139,   6,  12,  37,  23,  51,  59,   2,
       201,  72,  14,  49,  43,   7,   9,  21, 101, 202, 174,  28, 153,
        56, 236,  30, 167,  15, 198,  17, 130,  16,  25,  81,  13,  77,
        42,  64,   4,  88, 132, 395,  45, 143,  47,  39,  33, 976,  26,
         8], dtype=int64)

### df['칼렁명']: 특정 칼럼의 값 확인

In [90]:
df_olympics['Gold']

0       0
1       5
2      18
3       1
4       3
       ..
141    26
142     0
143     0
144     3
145     8
Name: Gold, Length: 146, dtype: int64

### df['칼럼명'].sort_values() : 특정 칼럼의 값을 정렳기

In [93]:
df_olympics['Bronze'].sort_values() #default 값은 오름차순

26       0
42       0
75       0
77       0
84       0
      ...
44     217
41     246
49     272
106    296
135    666
Name: Bronze, Length: 146, dtype: int64

In [94]:
df_olympics['Bronze'].sort_values(ascending=False) #내림차순

135    666
106    296
49     272
41     246
44     217
      ...
117      0
118      0
29       0
26       0
35       0
Name: Bronze, Length: 146, dtype: int64

### count(): 데이터 개수 세기

In [96]:
df_olympics.count() # 각 칼럼에 몇개의 데이터가 있는지 확인 할 수 있음

Country           146
# Summer          146
Gold              146
Silver            146
Bronze            146
Total             146
# Winter          146
Gold.1            146
Silver.1          146
Bronze.1          146
Total.1           146
# Games           146
Gold.2            146
Silver.2          146
Bronze.2          146
Combined total    146
dtype: int64

### value_counts(): 카테고리별 데이터 값 세기

In [97]:
df_olympics['Bronze'].value_counts()

0      23
1      20
2      13
11      7
4       6
3       5
5       5
10      4
8       3
12      3
15      3
39      3
28      3
55      2
142     2
35      2
29      2
9       2
6       2
65      1
13      1
20      1
19      1
21      1
80      1
125     1
104     1
43      1
7       1
119     1
24      1
185     1
27      1
176     1
296     1
217     1
25      1
68      1
177     1
53      1
78      1
121     1
126     1
70      1
45      1
17      1
165     1
117     1
246     1
14      1
36      1
127     1
81      1
272     1
666     1
Name: Bronze, dtype: int64